from datetime import timedelta
token = 'vk1.a.RDPnOJHFkDKjD_osc3F2n-qnHTs4ULwEyK7IWL3zCJvKMyduGDxJNf5rFTFN0YcubEapBeqVneW7w27tRpy6VqMD4rkdCKuiPFBnkUf9XBKEcSddeSjv44PXds9CCYKcURmx2wmir5AeJ8oXYSQweWH3rXUnNqr0UirVQ2HlmUS4KTZYERzOfXIk_IAMDAg-h0hpvFKUtiQddnqok0BsbQ'
BOT_NAME = "Пельмень"
farm_income = {1: "50", 2: "300", 3: "1000", 4: "6000"}
farm_prices = {1: 300000, 2: 700000, 3: 1000000, 4: 3000000}
successfull_registration = (f"Привет! Я бот {BOT_NAME}." 
                            "\nСпасибо за регистрацию!" 
                            " Держи бонус в размере 3.500$, прописывай «Помощь»" 
                            " и становись самым крутым! \nУдачи!")
phrases = {
    1: "классный никнейм 🔥", 2: "королевский никнейм 👑", 3: "стильный никнейм 💯", 4: "уникальный никнейм 🌟",
    5: "зажигательный никнейм 🎉", 6: "оригинальный никнейм 🌈", 7: "легендарный никнейм 🏆", 8: "мощный никнейм 💪",
    9: "крутой никнейм 😎", 10: "огненный никнейм 🔥", 11: "безупречный никнейм ✨", 12: "неповторимый никнейм 🌟",
    13: "бесподобный никнейм 💫", 14: "захватывающий никнейм 🌪️", 15: "магический никнейм 🧙", 16: "стильный никнейм 💥",
    17: "суперский никнейм 🦸", 18: "эпический никнейм 🚀", 19: "невероятный никнейм 🌌", 20: "непобедимый никнейм ⚔️",
    21: "необычный никнейм 🤩", 22: "невероятный никнейм 🌟", 23: "потрясающий никнейм 🔥", 24: "блестящий никнейм ✨",
    25: "фантастический никнейм 🌟"
}
BITCOIN_COST = 1950
emoji_dict = {
    '1': '1️⃣',
    '2': '2️⃣',
    '3': '3️⃣',
    '4': '4️⃣',
    '5': '5️⃣',
    '6': '6️⃣',
    '7': '7️⃣',
    '8': '8️⃣',
    '9': '9️⃣',
    '0': '0️⃣'
}
multipliers = [0, 0.25, 0.5, 0.75, 1, 1.5, 2.5, 3.0, 5.0, 10.0]
flat_cost = {'1': '25000', 
             '2': '100000', 
             '3': '500000', 
             '4': '3000000', 
             '5': '25000000',
             '6': '75000000',
             '7': '300000000'
            }
car_cost = {'1': '10000', 
             '2': '100000', 
             '3': '700000', 
             '4': '2500000', 
             '5': '25000000',
             '6': '300000000',
             '7': '555000000',
             '8': '15000000000'
            }
yacht_cost = {'1': '1000000', 
             '2': '10000000', 
             '3': '70000000', 
             '4': '250000000', 
             '5': '2500000000',
             '6': '30000000000'
            }